In [1]:
#Ans1
import pandas as pd

In [5]:
s=pd.Series([4,8,15,16,42])

In [6]:
s

0     4
1     8
2    15
3    16
4    42
dtype: int64

In [7]:
#Ans2
l1=[10,20,30,40,50]

In [8]:
s1=pd.Series(l1)

In [9]:
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [10]:
#ANS3

In [11]:
d1={ 'Name':['Alice','Bob','Claire'],
      'Age':[25,30,27],
    'gender':['female','Male','Female']}

In [12]:
d2=pd.DataFrame(d1)

In [13]:
d2

     Name  Age  gender
0   Alice   25  female
1     Bob   30    Male
2  Claire   27  Female

In [14]:
#ans4

In [15]:
'''A series is a one dimentional storage while a Dataframe is multidimentional storage od data.
A series can store data of similar type only while dataframe can store multiple datatypes within it .

d1={ 'Name':['Alice','Bob','Claire'],
      'Age':[25,30,27],
    'gender':['female','Male','Female']}
d2=pd.DataFrame(d1)
print(d2)

above code will create a dataframe

s=pd.Series([4,8,15,16,42])

this will create a series .'''

"A series is a one dimentional storage while a Dataframe is multidimentional storage od data.\nA series can store data of similar type only while dataframe can store multiple datatypes within it .\n\nd1={ 'Name':['Alice','Bob','Claire'],\n      'Age':[25,30,27],\n    'gender':['female','Male','Female']}\nd2=pd.DataFrame(d1)\nprint(d2)\n\nabove code will create a dataframe\n\ns=pd.Series([4,8,15,16,42])\n\nthis will create a series ."

In [16]:
#ans5

read_csv()
read_excel()
isnull()
head()
tail()
columns
sort_values()
drop()
fillna()

Ans6 
DataFrame
Panel

In [17]:
#ans7
import pandas as pd
s7=pd.Series(['Sudh','Krish','Sonu'])
s8=pd.Series([23,46,66])

In [18]:
df1=pd.DataFrame({'name':s7,'rollno':s8})

In [19]:
df1

    name  rollno
0   Sudh      23
1  Krish      46
2   Sonu      66